from clas import SQL_otchet

sql = """
SELECT
    a.AGNNAME ORGANIZATION ,
    bi.CODE  pokazatel,
    NUMVAL value
FROM PARUS.BLINDEXVALUES  d
INNER JOIN PARUS.BLSUBREPORTS s
ON (d.PRN = s.RN)
INNER JOIN PARUS.BLREPORTS r
ON(s.PRN = r.RN)
INNER JOIN PARUS.AGNLIST a 
on(r.AGENT = a.rn)
INNER JOIN PARUS.BLREPFORMED pf
on(r.BLREPFORMED = pf.RN)
INNER JOIN PARUS.BLREPFORM rf 
on(pf.PRN = rf.RN)
INNER JOIN PARUS.BALANCEINDEXES bi 
on(d.BALANCEINDEX = bi.RN)
WHERE rf.CODE = 'ТрадицРД'
and bi.CODE in (
    'infrod2_01', 'infrod2_02', 'infrod2_03', 'infrod2_04', 'infrod2_05', 'infrod2_06',
    'infrod2_07', 'infrod2_08', 'infrod2_09', 'infrod2_10', 'infrod2_11', 'infrod2_12',
    'infrod2_13', 'infrod2_14', 'infrod2_15', 'infrod2_16', 'infrod2_17', 'infrod2_18',
    'infrod2_19', 'infrod2_20', 'infrod2_21', 'infrod2_22', 'infrod2_23', 'infrod2_24',
    'infrod2_25', 'infrod2_26', 'infrod2_27', 'infrod2_28', 'infrod2_29', 'infrod2_30',
    'infrod2_31', 'infrod2_32', 'infrod2_33', 'infrod2_34', 'infrod2_35', 'infrod2_36',
    'infrod2_37', 'infrod2_38', 'infrod2_39', 'infrod2_40', 'infrod2_41', 'infrod2_42',
    'infrod2_43', 'infrod2_44', 'infrod2_45', 'infrod2_46', 'infrod2_47', 'infrod2_48',
    'infrod2_49', 'infrod2_50', 'infrod2_51', 'infrod2_52', 'infrod2_53', 'infrod2_54',
    'infrod2_55', 'infrod2_56', 'infrod2_57', 'infrod2_58', 'infrod2_59', 'infrod2_60',
    'infrod2_61', 'infrod2_62', 'infrod2_63', 'infrod2_64', 'infrod2_65', 'infrod2_66',
    'infrod2_67', 'infrod2_68', 'infrod2_69', 'infrod2_70', 'infrod2_71', 'infrod2_72',
    'infrod2_73', 'infrod2_74', 'infrod2_75', 'infrod2_76', 'infrod2_77', 'infrod2_78',
    'infrod2_79', 'infrod2_80', 'infrod2_81', 'infrod2_82', 'infrod2_83', 'infrod2_84',
    'infrod2_85'
)
and r.BDATE between  to_date(__start__,'yyyymmdd')
    AND  to_date(__stop__,'yyyymmdd')
"""

columns = {
    "01. Дифтерия": ("_01", "_02", "_03", "_04", "_05"),
    "02. Бактерионосительство токсигенных штаммов дифтерии": (
        "_06",
        "_07",
        "_08",
        "_09",
        "_10",
    ),
    "03. Коклюш": ("_11", "_12", "_13", "_14", "_15"),
    "04. Скарлатина": ("_16", "_17", "_18", "_19", "_20"),
    "05. Ветряная оспа": ("_21", "_22", "_23", "_24", "_25"),
    "06. Эпидемический паротит": ("_26", "_27", "_28", "_29", "_30"),
    "07. Корь": ("_31", "_32", "_33", "_34", "_35"),
    "08. Краснуха": ("_36", "_37", "_38", "_39", "_40"),
    "09. Менингококковая инфекция": ("_41", "_42", "_43", "_44", "_45"),
    "10. Менингококкцемия, гнойный менингит": ("_46", "_47", "_48", "_49", "_50"),
    "11. Инфекционный мононуклеоз": ("_51", "_52", "_53", "_54", "_55"),
    "12. Грипп": ("_56", "_57", "_58", "_59", "_60"),
    "13. ОРЗ": ("_61", "_62", "_63", "_64", "_65"),
    "14. Туберкулез (все формы)": ("_66", "_67", "_68", "_69", "_70"),
    "15. Туберкулез органов дыхания": ("_71", "_72", "_73", "_74", "_75"),
    "16. Бациллярные формы туберкулеза органов дыхания": (
        "_76",
        "_77",
        "_78",
        "_79",
        "_80",
    ),
    "17. Коронавирусная инфекция COVID-19": ("_81", "_82", "_83", "_84", "_85"),
}

rows = {
    "1. ВСЕГО (до 28 суток)": (
        "_01",
        "_06",
        "_11",
        "_16",
        "_21",
        "_26",
        "_31",
        "_36",
        "_41",
        "_46",
        "_51",
        "_56",
        "_61",
        "_66",
        "_71",
        "_76",
        "_81",
    ),
    "2. занос (родильницы)": (
        "_02",
        "_07",
        "_12",
        "_17",
        "_22",
        "_27",
        "_32",
        "_37",
        "_42",
        "_47",
        "_52",
        "_57",
        "_62",
        "_67",
        "_72",
        "_77",
        "_82",
    ),
    "3. внутрибольничных у родильниц": (
        "_03",
        "_08",
        "_13",
        "_18",
        "_23",
        "_28",
        "_33",
        "_38",
        "_43",
        "_48",
        "_53",
        "_58",
        "_63",
        "_68",
        "_73",
        "_78",
        "_83",
    ),
    "4. внутрибольничных у новорожденных": (
        "_04",
        "_09",
        "_14",
        "_19",
        "_24",
        "_29",
        "_34",
        "_39",
        "_44",
        "_49",
        "_54",
        "_59",
        "_64",
        "_69",
        "_74",
        "_79",
        "_84",
    ),
    "5. с 2 или более очагов": (
        "_05",
        "_10",
        "_15",
        "_20",
        "_25",
        "_30",
        "_35",
        "_40",
        "_45",
        "_50",
        "_55",
        "_60",
        "_65",
        "_70",
        "_75",
        "_80",
        "_85",
    ),
}

infections_6 = SQL_otchet(
    filename="/tmp/Традиционные_инфекции.xlsx",
    sql=sql,
    columns=columns,
    cols_name="Нозологические формы",
    rows=rows,
    rows_name="Количество случаев инфекционных заболеваний",
    del_col=[],
    pivot={
        "index": ["ORGANIZATION", "Количество случаев инфекционных заболеваний"],
        "columns": ["Нозологические формы"],
        "values": ["VALUE"],
        "aggfunc": "first",
    },
)
